/*
 * Copyright (c) Juergen Urban, All rights reserved.
 * 
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 *      but WITHOUT ANY WARRANTY; without even the implied warranty of
 *      MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 *      Lesser General Public License for more details.
 * 
 *      You should have received a copy of the GNU Lesser General Public
 *      License along with this library.
 */

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <fcntl.h>
#include <unistd.h>

#include <sys/types.h>
#include <sys/stat.h>
#include <sys/ioctl.h>

#include "rua.h"
#include "dcc.h"

/** Print debug message. */
#if 0
#define DPRINTF(args...) printf(args)
#else
#define DPRINTF(args...) do { } while(0)
#endif

/** Print error message. */
#define EPRINTF(format, args...) fprintf(stderr, "librua: " __FILE__ ":%d: Error: " format, __LINE__, ## args)

#define USER_DATA_SIZE 0x1000

typedef RMuint32 dcc_malloc_t(struct RUA *pRua, RMuint32 ModuleID, RMuint32 dramIndex, enum RUADramType dramtype, RMuint32 size);
typedef void dcc_free_t(struct RUA *pRua, RMuint32 addr);

struct DCC {
	struct RUA *pRua; // 0x00
	RMuint32 video_ucode_address;
	RMuint32 audio_ucode_address;
	RMuint32 demux_ucode_address;
	RMuint32 dram; // 0x10
	dcc_malloc_t *rua_malloc; // 0x14
	dcc_free_t *rua_free; // 0x18
};

typedef struct {
	RMuint32 PictureAddr;
	RMuint32 LumaAddress;
	RMuint32 LumaSize;
	RMuint32 ChromaAddress;
	RMuint32 ChromaSize;
	RMuint32 PaletteAddress;
	RMuint32 PaletteSize;
} pic_info_t;

struct SPUDecoderSource {                                                       
};

struct DCCVideoSource {
	struct DCC *pDCC; // 0x00
	struct RUA *pRua; // 0x04
	RMuint32 decodermoduleid; // 0x08
	RMuint32 enginemoduleid; // 0x0c
	RMuint32 spudecodermoduleid; // 0x10
	RMuint32 scalermoduleid; // 0x14
	RMuint32 mixermoduleid;
	RMuint32 picture_count;
	pic_info_t *pic_info;
	RMuint32 bitprot; // 0x24
	RMuint32 unprot; // 0x2c
	RMuint32 picprot; // 0x44
	RMuint32 STCID; // 0x54
	RMuint32 surface; // 0x58
	struct SPUDecoderSource *spu_decoder; // 0x6c
};

struct DCCSTCSource {
	struct RUA *pRua;
	RMuint32 StcModuleId;
};

struct DCCResource {
	RMuint32 schedmem;
	RMuint32 schedmemsize;
	RMuint32 decodershmem;
	RMuint32 decodershmemsize;
	RMuint32 picprot;
	RMuint32 picprotsize;
	RMuint32 bitprot;
	RMuint32 bitprotsize;
	RMuint32 unprot;
	RMuint32 unprotsize;
	RMuint32 reserveddata;
	RMuint32 reservedsize;
};

struct DCCAudioSource {
	struct RUA *pRua; // 0x00
	struct DCC *pDCC; // 0x04
	RMuint32 decodermoduleid; // 0x08
	RMuint32 enginemoduleid; // 0x0c
	RMuint32 STCID; // 0x18
	RMuint32 reserved1C; // 0x1c
	RMuint32 mem1; // 0x20
	RMuint32 mem2; // 0x2c
};

static RMuint32 default_rua_malloc(struct RUA *pRua, RMuint32 ModuleID, RMuint32 dramIndex, enum RUADramType dramtype, RMuint32 size)
{
	(void) ModuleID;

	return RUAMalloc(pRua, dramIndex, dramtype, size);
}

static void default_rua_free(struct RUA *pRua, RMuint32 addr)
{
	RUAFree(pRua, addr);
}

static RMstatus send_video_command(struct RUA *pRua, RMuint32 decodermoduleid, RMuint32 cmd)
{
	RMstatus rv;
	struct RUAEvent event;
	RMuint32 index;
	RMuint32 state;
	RMuint32 status;

	event.ModuleID = decodermoduleid;
	event.Mask = 1;
	rv = RUAResetEvent(pRua, &event);
	if (rv != RM_OK) {
		return rv;
	}

	rv = RUASetProperty(pRua, decodermoduleid, RMVideoDecoderPropertyID_Command, &cmd, sizeof(cmd), 0);
	if (rv != RM_OK) {
		return rv;
	}

	rv = RUAWaitForMultipleEvents(pRua, &event, 1, 1000000, &index);
	if (rv != RM_OK) {
		return rv;
	}

	rv = RUAGetProperty(pRua, decodermoduleid, RMVideoDecoderPropertyID_State, &state, sizeof(state));
	if (rv != RM_OK) {
